Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/the_general_election.html.txt.tmx
Source language: en
Languages: ga

source: A general election must be held within 30 days of the dissolution of the Dáil
ga: Ní foláir olltoghchán a bheith ann taobh istigh de 30 lá ó lánscor na Dála

source: The procedure is that the Clerk of the Dáil issues a writ to the returning officer in each constituency instructing them to hold an election
ga: Eisíonn Cléireach na Dála eascaire don cheann comhairimh i ngach dáilcheantar ag tabhairt ordaithe dó/di toghchán a reáchtáil

source: The Minister for Housing, Planning and Local Government appoints the polling day which must be between the 18th and 25th day (excluding Good Friday, Sundays and public holidays) after the issue of the writ
ga: Ceapann an tAire Tithíochta, Pleanála, Pobal agus Rialtais Áitiúil an lá vótaíochta nach mór a reáchtáil idir an 18ú agus an 25ú lá tar éis aon eascaire a eisiúint (ní bhíonn Aoine an Chéasta, Domhnaí agus Saoirí poiblí san áireamh)

source: The Minister also appoints the polling period which must consist of at least 12 hours between 7am and 10.30pm
ga: Ceapann an tAire an tréimhse vótaíochta freisin a mhairfidh ar feadh 12 uair an chloig ar a laghad idir 7rn agus 10.30in

source: More information about general elections is available in the following documents:
ga: Tá tuilleadh faisnéise faoi olltoghcháin sna doiciméid seo leanas:

source: • Who can be elected to the Dail
ga: • Cé is féidir a thoghadh don Dáil?

source: • How do you become a Dail candidate
ga: • Cén chaoi ar féidir leat a bheith mar iarrthóir Dála?

source: • Who can vote at a Dail election
ga: • Cé atá i dteideal vótála i dtoghchán Dála?

source: • How do you vote in a General Election
ga: • Cén chaoi a vótálann tú in olltoghchán?

source: • How are the votes counted
ga: • Cén chaoi a chomháirítear vótaí?

source: • What are the rules about election expenses
ga: • Céard iad na rialacha a bhaineann le costais toghcháin?

source: General election posters and signs
ga: Póstaeir agus fógraí do thoghcháin ghinearálta

source: The law forbids the erection of posters or signs on poles or other structures in public places unless you have the written permission of the owner of the pole or other structure in advance of putting up the posters or signs
ga: Ní cheadaíonn dlí póstaeir nó fógraí a chur ar chuaillí nó struchtúir eile in áiteanna poiblí gan cead scríofa bheith faighte ó úinéir an chuaille nó an struchtúir eile roimh ré

source: Posters are only allowed to be erected for a certain specified time period before an election
ga: Níl sé ceadaithe póstaeir a chur suas ach le linn tréimhse áirithe roimh thoghchán

source: Posters can be erected 30 days before the election or from the date of the polling day order for the election, whichever is the shorter period of time
ga: Is féidir póstaeir a chur suas ón 30ú lá roimh lá na vótála, nó ar feadh 30 lá tar éis an dáta ar a n-eisítear an tOrdú um Lá Vótála, pé acu an tréimhse is giorra

source: Following a general election, a party or candidate must remove posters within a 7-day period
ga: Tar éis toghchán ginearálta, ní mór do pháirtí nó iarrthóir póstaeir a bhaint taobh istigh de thréimhse 7 lá

source: After that date, an on-the-spot fine of €150 is issued by your local authority in respect of each offence
ga: Tar éis na tréimhse sin, gearrfaidh an t-údarás áitiúil fíneáil láithreach de €150 i dtaca le gach póstaer nach mbaintear

source: Your local authority will remove the poster as the fine is issued
ga: Agus an fhíneáil á heisiúint, bainfidh an t-údarás áitiúil an póstaer

source: If a party or candidate has been issued with a fine and refuses to pay, they can be prosecuted in the District Court by their local authority to enforce payment
ga: Má dhiúltaíonn páirtí nó iarrthóir fíneáil atá eisithe a íoc, is féidir leis an údarás áitiúil iad a ionchúiseamh sa Chúirt Dúiche chun an íocaíocht a fháil
